package ua.lviv.iot.lab2.manager;

import java.util.Scanner;
import java.util.regex.*;

public class RegularExpressionLab {
  private String text="Городоцька вул.\r\n"
      + "буд. 26\r\n"
      + "Поштовий індекс:\r\n"
      + "79007\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(15-27), П(8-22)\r\n"
      + "Поштовий індекс:\r\n"
      + "79007\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 31-47\r\n"
      + "Поштовий індекс:\r\n"
      + "79007\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(5-13)\r\n"
      + "Поштовий індекс:\r\n"
      + "79007\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 2-4\r\n"
      + "Поштовий індекс:\r\n"
      + "79007\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. П(98-110), Н(123-177)\r\n"
      + "Поштовий індекс:\r\n"
      + "79018\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(309-317)\r\n"
      + "Поштовий індекс:\r\n"
      + "79040\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(291-305), П(214-218)\r\n"
      + "Поштовий індекс:\r\n"
      + "79040\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 319\r\n"
      + "Поштовий індекс:\r\n"
      + "79040\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 222, 232, 252, П(262-282), 359, 371, 369\r\n"
      + "Поштовий індекс:\r\n"
      + "79040\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 128, 128а, 126, 124, 120, 118\r\n"
      + "Поштовий індекс:\r\n"
      + "79015\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 181, Н(185-189)\r\n"
      + "Поштовий індекс:\r\n"
      + "79015\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(197-209), П(136-150), 134, 132\r\n"
      + "Поштовий індекс:\r\n"
      + "79015\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 83, 83а, 81, 79, 77, 75, 73, 71, 67, 65, 63, 61, 59, 57, 55, 53, 51, 38, 36, 32\r\n"
      + "Поштовий індекс:\r\n"
      + "79016\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 50-119\r\n"
      + "Поштовий індекс:\r\n"
      + "79016\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. П(186-190), 200, 202, 206, 208, 210а\r\n"
      + "Поштовий індекс:\r\n"
      + "79022\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(271-277), 281, 287, 289, 210, 212\r\n"
      + "Поштовий індекс:\r\n"
      + "79022\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 241б, 168а, П(168-174), 251, 253, 257, 259, Н(263-269)\r\n"
      + "Поштовий індекс:\r\n"
      + "79022\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. Н(211-227)\r\n"
      + "Поштовий індекс:\r\n"
      + "79041\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. 229, 231, 235, 239, 160, 154\r\n"
      + "Поштовий індекс:\r\n"
      + "79041\r\n"
      + "Поштове відділенняСтарий поштовий індексПоказати на карті\r\n"
      + "Городоцька вул.\r\n"
      + "буд. П(50-86)\r\n"
      + "Поштовий індекс:\r\n"
      + "79016";
  public String getText() {
    return text;
  }

  public void setText(String text) {
    this.text = text;
  }

  public RegularExpressionLab() {
  }

  public RegularExpressionLab(String text) {
    this.text = text;
  }

  String pattern = "790+\\\\d{2}";

  public void findRegExprInText() {
    String regex = "790+\\d{2}";
    Pattern p = Pattern.compile(regex);
    Matcher m = p.matcher(this.text);
    while(m.find()) {
       System.out.println(m.group());
    }
  }

}